const Characters = [
    {
        name: 'Базз Лайтер', image: 'images/buzz.jpg', film: 0,
        description: 'Базз Лайтер - отважный и преданный космический рейнджер, герой из мира игрушек, чья смелость и верность своим друзьям стали символом приключений и дружбы. С его ярко-синей космической формой, сверкающими крыльями и непоколебимой уверенностью в себе, Базз Лайтер выделяется среди других игрушек.\n' +
            '\n' +
            'Базз начинает свои приключения, считая себя настоящим космическим рейнджером, и его фантастическая вера в свои способности добавляет неповторимый шарм этому персонажу. Он всегда готов взлететь в небеса и исследовать новые горизонты в мире игрушек, сражаясь со злодеями и защищая своих друзей.\n' +
            '\n' +
            'Базз Лайтер проявляет выдающуюся самоотдачу и преданность команде, особенно своему верному другу Вуди. Вместе они создают идеальный тандем, дополняя друг друга в различных ситуациях. Базз также способен к самоиронии, что делает его любимцем как у маленьких, так и у взрослых поклонников.\n' +
            '\n' +
            'Базз Лайтер - символ неудержимой энергии, доблести и верности, ставший незаменимой частью мира игрушек. Его приключения и дружба с Вуди создают несравненную атмосферу радости и вдохновения в истории игрушек.' ,
        gallery: [
            "images/buzz/buzz1.jpg",
            "images/buzz/buzz2.jpg",
            "images/buzz/buzz3.jpg",
            "images/buzz/buzz4.jpg",
            "images/buzz/buzz5.jpg",
            "images/buzz/buzz6.jpg",
            "images/buzz/buzz7.jpg"
        ]
    },
    {
        name: 'Вуди', image: 'images/woody.jpg', film: 0,
        description: 'Вуди - отважный ковбой и лидер игрушек, чья непревзойденная доброта и преданность сделали его сердцем и душой мира игрушек. С его традиционным ковбойским нарядом, добрым взглядом и узнаваемой шляпой, Вуди выступает в роли защитника и друга, всегда готового помочь своим товарищам.\n' +
            '\n' +
            'Вуди - не просто ковбой, но и идеальный лидер, который всегда ставит благополучие группы выше своих собственных интересов. Его терпение и мудрость помогают разрешать конфликты и вдохновлять других игрушек. Вуди обладает уникальным талантом крепкой дружбы, чего находит подтверждение в его близкой связи с Баззом Лайтером.\n' +
            '\n' +
            'Несмотря на свою добродушность, Вуди также обладает долей приключенческого духа, что делает его захватывающим персонажем для детей и взрослых. Его оптимизм и вера в хорошее позволяют ему преодолевать трудности и быть примером для остальных.\n' +
            '\n' +
            'Вуди - символ тепла, вдохновения и бескорыстной дружбы в мире игрушек. Его похождения и связь с другими персонажами создают неповторимую атмосферу в истории игрушек, делая его любимцем поклонников всего мира.',
        gallery: [
            "images/woody/woody1.jpg",
            "images/woody/woody2.jpg",
            "images/woody/woody3.jpg",
            "images/woody/woody4.jpg",
            "images/woody/woody5.jpg",
            "images/woody/woody6.jpg"
        ]
    },
    {
        name: 'Джесси', image: 'images/jessie.jpg', film: 0,
        description: 'Джесси - бесстрашная ковбойка из мира игрушек, чья живость и энергия делают ее уникальной и любимой среди других персонажей. Ее розовая ковбойская одежда, красные пистолеты и веселые косички создают неповторимый облик, который выделяет ее в этом захватывающем игрушечном мире.\n' +
            '\n' +
            'Джесси производит яркое впечатление своим оптимизмом и бесконечной энергией. Ее жизненное кредо - веселиться и не бояться новых приключений. Вместе с Вуди и Баззом Лайтером, Джесси создает дружную команду, способную противостоять любым трудностям.\n' +
            '\n' +
            'Как ковбойка, Джесси обладает уникальными навыками и смелостью, что позволяет ей принимать активное участие в различных заданиях. Ее дружелюбие и способность находить радость в самых маленьких вещах делают ее привлекательным персонажем для малышей и их родителей.\n' +
            '\n' +
            'Джесси - не только ковбойка, но и важная часть большой игрушечной семьи. Ее смех, решимость и любовь к жизни добавляют динамизма и вдохновения в мир игрушек, делая ее одним из наиболее любимых персонажей в этой увлекательной истории.',
        gallery: [
            "images/jessie/jessie1.jpg",
            "images/jessie/jessie2.jpg",
            "images/jessie/jessie3.jpg",
            "images/jessie/jessie4.jpg",
            "images/jessie/jessie5.jpg",
            "images/jessie/jessie6.jpg"
        ]
    },
    {
        name: 'Молния', image: 'images/mcqueen.png', film: 1,
        description: 'Молния МакКуин - горячий и амбициозный гоночный автомобиль, чья страсть к скорости и постоянное стремление к победе делают его одним из самых ярких персонажей в мире мультипликационных автомобилей. Его красно-синяя окраска, внушительные номера и стильные наклейки делают его узнаваемым в любой гоночной среде.\n' +
            '\n' +
            'Молния МакКуин начал свой путь как молодой и перспективный гонщик, и его невероятный талант и азарт заработали ему многочисленные поклонники. Он не только стремится к победе, но и ценит дружбу и солидарность в мире автомобилей. Его история покажет, что путь к успеху часто включает в себя исключительные уроки и неожиданные повороты.\n' +
            '\n' +
            'Молния МакКуин - символ скорости, упорства и самосовершенствования. Его способность преодолевать трудности и находить вдохновение вокруг себя делают его образом, который вдохновляет не только маленьких гонщиков, но и тех, кто стремится к своим собственным целям в жизни.\n' +
            '\n' +
            'Весь его опыт говорит о том, что путь к успеху не всегда прямой, но с верой в себя и готовностью принимать вызовы, даже самые сложные, Молния МакКуин становится истинным лидером и героем своего автомобильного мира.',
        gallery: [
            "images/mcqueen/mcqueen1.jpg",
            "images/mcqueen/mcqueen2.jpg",
            "images/mcqueen/mcqueen3.jpg",
            "images/mcqueen/mcqueen4.jpg",
            "images/mcqueen/mcqueen5.jpg",
            "images/mcqueen/mcqueen6.jpg"
        ]
    },
    {
        name: 'Мэтр', image: 'images/mater.png', film: 1,
        description: 'Мэтр - надежный и преданный грузовик, чья простота и трудолюбие делают его незаменимым персонажем в мире автомобилей. С его коричнево-красной окраской, прочной конструкцией и удобствами для перевозки, Мэтр выглядит как надежный трудяга, всегда готовый помочь своим друзьям.\n' +
            '\n' +
            'Мэтр начал свою карьеру как владелец старой заправочной станции в маленьком городке, но его доброта и честность привлекли внимание Молнии МакКуина и других автомобилей. Он не только умеет ремонтировать и обслуживать, но и всегда поддерживает своих друзей в трудные моменты.\n' +
            '\n' +
            'Скромный и ответственный, Мэтр стал символом того, что даже самые простые и скромные автомобили могут быть невероятно ценными в автомобильном сообществе. Его уважение к старым традициям и оптимизм вносят веселый и теплый налет в мир гонок и приключений.\n' +
            '\n' +
            'Мэтр - пример верного друга и трудяги, который доказывает, что каждый в мире автомобилей имеет свою уникальную роль и важность. Его история вдохновляет на принятие себя таким, какой ты есть, и ценность труда в достижении общих целей.',
        gallery: [
            "images/mater/mater1.png",
            "images/mater/mater2.jpg",
            "images/mater/mater3.jpg",
            "images/mater/mater4.jpg",
            "images/mater/mater5.jpg",
            "images/mater/mater6.jpg"
        ]
    },
    {
        name: 'Салли', image: 'images/sally.jpg', film: 1,
        description: 'Салли Каррера - элегантная Porsche 911 Carrera, чья интеллигентность и доброжелательность сделали её одним из наиболее привлекательных персонажей в анимационном мире "Тачек". Её голубой лак, изысканный дизайн и изящные формы придают ей аристократичный вид среди разнообразных автомобилей Радиатор-Спрингса.\n' +
            '\n' +
            'Салли не только красива, но и умна. Она владеет автомобильным магазином "Колесница", который стал центром общения и встреч для жителей городка. Её предприимчивость и умение создавать теплую и дружественную атмосферу привлекают клиентов и друзей. В "Колеснице" можно не только починить автомобиль, но и насладиться приятным обществом, обменяться новостями или просто наслаждаться природой и спокойствием.\n' +
            '\n' +
            'Салли является важной частью сообщества Тачек, где каждый персонаж, несмотря на свою индивидуальность, находит своё место. Её отношения с Молнией МакКуином также придают романтическую историю этому анимационному миру. Салли - не просто красивая машина, но и символ того, что истинная красота раскрывается в умении создавать теплое и гостеприимное окружение для всех.',
        gallery: [
            "images/sally/sally1.jpg",
            "images/sally/sally2.jpg",
            "images/sally/sally3.webp",
            "images/sally/sally4.jpg",
            "images/sally/sally5.jpg"
        ]
    },
    {
        name: 'Док Хадсон', image: 'images/hudson.png', film: 1,
        description: 'Док Хадсон, также известный как Хадсон Хорнет, - символ мудрости и опыта в мире "Тачки". Этот старый и внушительный Hudson Hornet в прошлом был известным гонщиком, но теперь он обрел новый облик в виде городского судьи Радиатор-Спрингса.\n' +
            '\n' +
            'Седые бородатые щетины и серьезное выражение лица Дока Хадсона подчеркивают его авторитет и историю. Несмотря на свою заметную роль в автомобильном мире, Док предпочитает скрывать свое прошлое, но его мудрые советы и жизненный опыт делают его авторитетным наставником для молодых гонщиков, таких как Молния МакКуин.\n' +
            '\n' +
            'Док Хадсон - пример силы, выносливости и важности сохранения традиций. Его персона олицетворяет уважение к старому и новому поколению, а его способность поддерживать и вдохновлять говорит о том, что важность мудрости не исчезает со временем. Док Хадсон - ключевой персонаж в истории "Тачек", привносящий в неё глубину и уважение к корням автомобильного сообщества.',
        gallery: [
            "images/hudson/hudson1.png",
            "images/hudson/hudson2.jpg",
            "images/hudson/hudson3.jpg",
            "images/hudson/hudson4.jpg",
            "images/hudson/hudson5.png"
        ]
    },
    {
        name: 'Майк Вазовски', image: 'images/wazowski.jpg', film: 2,
        description: 'Майк Вазовски - талантливый и энергичный сотрудник Корпорации Монстров, известной своим профессионализмом в сборе и использовании энергии детских криков. Майк — страстный монстр, чья цель - стать лучшим исполнителем в своей области.\n' +
            '\n' +
            'С его заразительной улыбкой и неутомимым энтузиазмом Майк Вазовски является примером преданности своей работе. Его зеленая шерсть, большие глаза и зачаровывающая улыбка делают его яркой личностью среди монстров. На работе Майк демонстрирует высокий уровень креативности, применяя нестандартные подходы к сбору энергии, что делает его незаменимым членом команды.\n' +
            '\n' +
            'Майк часто выступает в паре со своим лучшим другом и коллегой, Джеймсом П. Салливаном, их комическое взаимодействие приносит радость и смех в Корпорацию Монстров. Вместе они создают неповторимый дуэт, способный справляться с самыми сложными задачами и преодолевать трудности.\n' +
            '\n' +
            'Майк Вазовски — не только отличный профессионал, но и верный друг, готовый поддержать своих коллег в любой ситуации. Его энергия, позитивный настрой и готовность к приключениям делают его незаменимым членом команды в мире монстров.' ,
        gallery: [
            "images/wazowski/wazowski1.jpg",
            "images/wazowski/wazowski2.jpg",
            "images/wazowski/wazowski3.jpg",
            "images/wazowski/wazowski4.jpg",
            "images/wazowski/wazowski5.jpg",
            "images/wazowski/wazowski6.jpg"
        ]
    },
    {
        name: 'Салливан', image: 'images/sullivan.jpg', film: 2,
        description: 'Джеймс P. Салливан, или просто Салли, - великолепный монстр и несравненный профессионал в сборе энергии детских криков в Корпорации Монстров. Салливан выделяется своей мощной физической формой, голубой шерстью и одним большим, впечатляющим глазом, что делает его неотъемлемой частью уникального сообщества монстров.\n' +
            '\n' +
            'Салли - опытный сотрудник, обладающий непревзойденными навыками в создании эффективных и творческих подходов к сбору энергии. Его креативные методы и невероятная сила делают его востребованным членом команды, способным преодолевать любые преграды. Несмотря на внушительный внешний вид, внутри этот монстр теплый и добрый, готовый помочь своим коллегам в любой ситуации.\n' +
            '\n' +
            'Салливан известен своим тесным дружбой с Майком Вазовски, их взаимодействие приносит в Корпорацию Монстров дополнительную порцию юмора и позитива. Совместно с Майком они образуют непревзойденный дуэт, способный справиться с самыми сложными задачами и развлечь аудиторию своим чарующим обаянием.\n' +
            '\n' +
            'Салливан не только профессионал своего дела, но и надежный друг, готовый поддержать и вдохновить своих коллег. Его веселый характер и непревзойденный опыт делают его одним из лучших монстров в мире Корпорации Монстров.',
        gallery: [
            "images/sullivan/sullivan1.jpg",
            "images/sullivan/sullivan2.jpg",
            "images/sullivan/sullivan3.jpg",
            "images/sullivan/sullivan4.jpg",
            "images/sullivan/sullivan5.jpg"
       ]
    },
    {
        name: 'Рэндалл', image: 'images/randall.jpg', film: 2,
        description: 'Рэндалл Богс - искусный и амбициозный монстр в рядах Корпорации Монстров, отличающийся своей интеллектуальностью и стратегическим мышлением. Его зеленая чешуя, острые уши и хитрый взгляд делают его выдающейся личностью в этом удивительном мире монстров.\n' +
            '\n' +
            'Рэндалл известен своими уникальными методами сбора энергии, которые часто основаны на изощренных стратегиях и интригах. Его способность к анализу и планированию позволяют ему эффективно справляться с задачами, что делает его ценным активом для Корпорации. На работе Рэндалл всегда находится в поиске новых и эффективных способов улучшения производительности.\n' +
            '\n' +
            'Хотя Рэндалл обладает серьезным и целеустремленным характером, его отношения с коллегами могут быть сложными из-за его амбиций. Тем не менее, его профессионализм и стремление к успеху делают его неотъемлемым членом команды. В сочетании с другими монстрами он может достичь великих высот в сборе энергии и доставить несметное количество удовольствия детям.\n' +
            '\n' +
            'Рэндалл Богс - монстр, чья решимость и интеллект сделали его выдающимся работником в мире Корпорации Монстров, добавляя в этот увлекательный процесс необходимую дозу хитрости и стратегического мышления.',
        gallery: [
            "images/randall/randall1.jpg",
            "images/randall/randall2.jpg",
            "images/randall/randall3.jpg",
            "images/randall/randall4.jpg",
            "images/randall/randall5.jpg"
        ]
    },
    {
        name: 'Реми', image: 'images/remi.png', film: 3,
        description: 'Реми - маленький истинный гурман с огромными амбициями из анимационного фильма "Рататуй". Этот умный и воображаемый крысёнок различает ароматы и вкусы с необычайной чувствительностью, что делает его уникальным среди своего вида.\n' +
            '\n' +
            'С момента, когда он находит свою страсть к готовке, Реми становится не только талантливым поваром, но и непреклонным исследователем кулинарного мира. Его талант восхищает и вдохновляет не только других гурманов-крыс, но и людей.\n' +
            '\n' +
            'Своим характером Реми демонстрирует упорство и смелость в деле достижения своей мечты. Великолепно сочетая творческий подход и настойчивость, он показывает, что истинное искусство и страсть могут преодолеть любые трудности, даже когда сталкиваешься с традиционными ограничениями и предрассудками.\n' +
            '\n' +
            'Реми - пример того, как страсть к тому, что ты любишь, может привести к удивительным результатам. Его история в "Рататуе" напоминает о том, что истинные таланты могут быть найдены в самых неожиданных местах, и что настоящее искусство касается не только великих шеф-поваров, но и тех, кто открывает для себя радость готовки.',
        gallery: [
            "images/remi/remi1.png",
            "images/remi/remi2.jpg",
            "images/remi/remi3.jpg",
            "images/remi/remi4.jpg",
            "images/remi/remi5.jpg"
        ]
    },
    {
        name: 'Лингвини', image: 'images/linguini.jpg', film: 3,
        description: 'Лингвини - персонаж из "Рататуя", представляющий собой неудачливого и неуверенного молодого парня, чья жизнь кардинально меняется, когда он встречает Реми, талантливого крысёнка-гурмана. Этот юноша с неуклюжей внешностью и неловкими манерами становится ключевой фигурой в истории гастрономических приключений.\n' +
            '\n' +
            'Сначала Лингвини не обладает кулинарными навыками, но с помощью Реми и его уникальных чувств кулинарии он начинает раскрывать свой потенциал. Лингвини оказывается на посту повара в известном ресторане, и его страстное стремление к достижению целей приводит к тому, что он становится неожиданным героем кулинарного мира.\n' +
            '\n' +
            'С преодолением своих сомнений и с привлечением талантов Реми, Лингвини обретает не только уверенность в себе, но и уважение коллег и признание в мире гастрономии. Его история служит прекрасным примером того, как внутренний огонь и стремление к совершенствованию могут привести к достижению выдающихся результатов.\n' +
            '\n' +
            'Лингвини - персонаж, который воплощает идею о том, что даже те, кто кажется неудачниками, могут обрести своё место в мире, следуя своим страстям и веря в себя.',
        gallery: [
            "images/linguini/linguini1.jpg",
            "images/linguini/linguini2.jpg",
            "images/linguini/linguini3.jpg",
            "images/linguini/linguini4.jpg",
            "images/linguini/linguini5.jpg"
        ]
    },
    {
        name: 'Колетт', image: 'images/colette.jpg', film: 3,
        description: 'Колетт - изысканная и талантливая шеф-повар в ресторане "Гюстав", персонаж из фильма "Рататуй". Её страсть к кулинарии и выдающиеся навыки делают её важным звеном в мире гастрономии. В своей профессиональной жизни Колетт выступает как пример успешной и самостоятельной женщины в кулинарной индустрии.\n' +
            '\n' +
            'С её прекрасным чувством вкуса и элегантным стилем приготовления блюд, Колетт является не только талантливой шеф-повар, но и вдохновляющей личностью для Лингвини и других членов команды. Её энергия и профессионализм создают атмосферу силы и гармонии в ресторане "Гюстав".\n' +
            '\n' +
            'Колетт также отличается своим лидерским качеством и умением мотивировать своих коллег. Её сотрудничество с Реми и Лингвини демонстрирует, что даже в мире высокой кухни важным является взаимодействие и взаимопонимание между членами команды.\n' +
            '\n' +
            'Колетт - пример страсти, таланта и решимости, что делает её не только великой шеф-поваром, но и образцом современной и успешной женщины в мире кулинарии. Её роль в "Рататуе" подчёркивает, что в кулинарном искусстве нет преград для тех, кто по-настоящему предан своему делу.',
        gallery: [
            "images/colette/colette1.jpg",
            "images/colette/colette2.jpg",
            "images/colette/colette3.jpg",
            "images/colette/colette4.png"
        ]
    },
    {
        name: 'Радость', image: 'images/radost.jpg', film: 4,
        description: 'Радость - один из ключевых персонажей в анимационном фильме "Головоломка" от Pixar. Энергичная и оптимистичная, Радость играет важную роль в управлении эмоциями десятилетней девочки по имени Райли. Её ярко-жёлтая внешность и весёлый настрой делают её одним из самых выразительных персонажей в умопомрачительном мире мозга.\n' +
            '\n' +
            'Радость представляет собой чувство, которое старается поддерживать Райли в оптимистичном настроении и наполнять её жизнь яркими впечатлениями. Её позитив и жизнерадостность создают положительное окружение в уме девочки, а также помогают ей переживать трудности и адаптироваться к новым обстоятельствам.\n' +
            '\n' +
            'В ходе фильма Радость сталкивается с различными эмоциями, включая грусть и страх, но её настойчивость и желание делать Райли счастливой подчёркивают силу позитивного мышления и важность баланса в эмоциональной жизни.\n' +
            '\n' +
            'Радость - не просто персонаж мультфильма, но и символ того, как важно ценить радость и оптимизм в своей жизни, даже в трудных моментах. Её история в "Головоломке" напоминает зрителям о том, что каждая эмоция имеет свою ценность и место в нашей жизни.',
        gallery: [
            "images/radost/radost1.jpg",
            "images/radost/radost2.jpg",
            "images/radost/radost3.jpg",
            "images/radost/radost4.jpg"
        ]
    },
    {
        name: 'Печаль', image: 'images/pechal.jpg', film: 4,
        description: 'Печаль - одно из важнейших чувств внутреннего мира десятилетней девочки Райли в анимационном фильме "Головоломка". Этот персонаж представлен в виде голубой женской фигуры, чьи черты отражают печаль и грусть. Вместе с остальными эмоциями, Печаль играет значимую роль в формировании эмоционального опыта Райли.\n' +
            '\n' +
            'Печаль появляется, когда Райли сталкивается с трудными событиями и переживает утраты. Это чувство несет на себе тяжесть эмоциональных испытаний и помогает девочке осознавать и обрабатывать сложные переживания. Печаль выступает важным элементом в формировании её личности и позволяет ей проходить через жизненные изменения.\n' +
            '\n' +
            'Хотя Печаль часто воспринимается как отрицательная эмоция, её наличие оказывается необходимым для полноценной жизни и реального понимания себя. В "Головоломке" Печаль учит, что даже в самых сложных моментах можно найти силу и пережить изменения, что в конечном итоге способствует росту и развитию личности.',
        gallery: [
            "images/pechal/pechal1.jpg",
            "images/pechal/pechal2.jpg",
            "images/pechal/pechal3.jpg",
            "images/pechal/pechal4.jpg",
            "images/pechal/pechal5.jpg"
        ]
    },
    {
        name: 'Гнев', image: 'images/gnev.jpg', film: 4,
        description: 'Гнев - одна из забавных и выразительных эмоций внутреннего мира десятилетней Райли в анимационном фильме "Головоломка". Представленный в виде ярко-красного персонажа, Гнев выступает в качестве чувства негодования и возмущения, вспыхивая в ответ на различные трудности и несправедливости, с которыми сталкивается девочка.\n' +
            '\n' +
            'Гнев отличается своим характерным красным цветом, высоким ростом и смешными выражениями лица. Его комические реакции на различные ситуации придают фильму легкость и юмор. Вместе с другими эмоциями, Гнев помогает Райли осуществлять более эмоциональную и человеческую жизнь.\n' +
            '\n' +
            'Гнев является частью естественного спектра эмоций, и его присутствие подчеркивает важность выражения чувств и самовыражения. В конечном итоге, Гнев в "Головоломке" помогает Райли осознавать свои предпочтения, а также формировать свою личность в ходе взросления.',
        gallery: [
            "images/gnev/gnev1.jpg",
            "images/gnev/gnev2.jpg",
            "images/gnev/gnev3.jpg",
            "images/gnev/gnev4.png",
            "images/gnev/gnev5.jpg"
        ]
    },
    {
        name: 'Брезгливость', image: 'images/brezglivoct.jpg', film: 4,
        description: 'Брезгливость в "Головоломке" представлена как зелёная фигура, чьи выражения лица и жесты передают отвращение и неприятие. Как одна из эмоций внутреннего мира Райли, Брезгливость вступает в игру, когда героиня сталкивается с чем-то неприятным или непригодным по её восприятию.\n' +
            '\n' +
            'Эмоциональные реакции Брезгливости в фильме служат не только источником юмора, но и позволяют Райли определять свои предпочтения и создавать собственные стандарты. Характерные моменты, когда Брезгливость вступает в игру, помогают подчеркнуть индивидуальность героини и её уникальный взгляд на окружающий мир.\n' +
            '\n' +
            'Важно отметить, что Брезгливость, подобно другим эмоциям внутреннего мира Райли, является естественной частью человеческого опыта. Через эти моменты фильм "Головоломка" рассказывает о том, как разнообразные эмоции влияют на формирование личности и способствуют пониманию самого себя в процессе взросления.',
        gallery: [
            "images/brezglivoct/brezglivoct1.jpg",
            "images/brezglivoct/brezglivoct2.jpg",
            "images/brezglivoct/brezglivoct3.jpg",
            "images/brezglivoct/brezglivoct4.jpg",
            "images/brezglivoct/brezglivoct5.jpg"
        ]
    },
    {
        name: 'Страх', image: 'images/strakh.jpg', film: 4,
        description: 'Страх - одно из важных чувств внутреннего мира Райли в фильме "Головоломка". Этот персонаж представлен в виде сиреневой фигуры и выражает беспокойство, тревогу и осторожность перед неизвестностью или потенциальными опасностями.\n' +
            '\n' +
            'Внешний вид Страха, с его большими глазами и изогнутой осанкой, отражает его беспокойство и нерешительность. Страх часто возникает в ответ на новые и страшные ситуации, создавая комические моменты в фильме. Его переживания также являются частью её эмоционального путешествия и формирования личности.\n' +
            '\n' +
            'Важной ролью Страха является обеспечение безопасности Райли через осторожность и предостережения. Вместе с другими эмоциями, он помогает героине понимать мир вокруг неё и развиваться, приспосабливаться к новым ситуациям.\n' +
            '\n' +
            'Таким образом, Страх в "Головоломке" не только предоставляет моменты юмора, но и играет важную роль в обеспечении безопасности и адаптации Райли к разнообразным аспектам её жизни.',
        gallery: [
            "images/strakh/strakh1.jpg",
            "images/strakh/strakh2.jpg",
            "images/strakh/strakh3.jpg",
            "images/strakh/strakh4.jpg",
            "images/strakh/strakh5.jpg"
        ]
    },
    {
        name: 'Мигель', image: 'images/migel.jpg', film: 5,
        description: 'Мигель — главный герой анимационного фильма "Тайна Коко", мальчик из мексиканского города Санта-Сесилия с большими амбициями и страстью к музыке. Его персонаж выражает в себе яркую индивидуальность и талант, а его приключения становятся ключом к разгадке семейных тайн и наследия.\n' +
            '\n' +
            'Внешне Мигель оживает с традиционным мексиканским видом: в майке, с сомбреро и гитарой. Он стремится к мечте стать музыкантом, несмотря на запрет музыки в своей семье. Его стремление к самовыражению и понимание собственных страстей заставляют его совершить захватывающее путешествие в Страну Мёртвых.\n' +
            '\n' +
            'Мигель олицетворяет темы семьи, традиций и самовыражения. Его история напоминает о важности сохранения своей индивидуальности и следования своим мечтам. В ходе своего путешествия он также узнает о ценности семейных связей и уважении к предкам.\n' +
            '\n' +
            'Мигель — яркий и вдохновляющий персонаж, становящийся символом силы культурных и семейных ценностей, а также важности следования своему сердцу.',
        gallery: [
            "images/migel/migel1.jpg",
            "images/migel/migel2.jpg",
            "images/migel/migel3.jpg",
            "images/migel/migel4.jpg",
            "images/migel/migel5.png"
        ]
    },
    {
        name: 'Гектор', image: 'images/hector.jpg', film: 5,
        description: 'Гектор — один из ключевых персонажей в анимационном фильме "Тайна Коко". Этот веселый и живой скелет является важным проводником для Мигеля в его приключениях в Стране Мёртвых. Гектор представляет собой яркую индивидуальность с сильным чувством юмора, который приносит свежий взгляд на мифологию о мёртвых.\n' +
            '\n' +
            'Внешне Гектор выделяется своим уникальным стилем — яркими цветами и креативными элементами в его "костюме". Его костюм и дух придумывания различных планов делают его незабываемым персонажем. Однако, несмотря на свою комическую сторону, Гектор также скрывает трагическую часть своей истории и стремится найти путь к Стране Живых.\n' +
            '\n' +
            'Гектор становится наставником и другом для Мигеля, помогая ему разгадать тайны своей семьи. Его история служит напоминанием о том, что за каждым ярким внешним обликом может скрываться глубокая и часто трогательная личная история.\n' +
            '\n' +
            'Гектор — персонаж, который не только приносит в фильм динамичность и юмор, но и важен для развития сюжета, подчёркивая темы семейных связей и значимости истории своего прошлого.',
        gallery: [
            "images/hector/hector1.jpg",
            "images/hector/hector2.jpg",
            "images/hector/hector3.jpg",
            "images/hector/hector4.jpg",
            "images/hector/hector5.jpg",
            "images/hector/hector6.jpg"
        ]
    },
    {
        name: 'Эрнесто де ла Круз', image: 'images/ernesto_de_la_cruz.jpg', film: 5,
        description: 'Эрнесто де ла Круз — важный антагонист в фильме "Тайна Коко". На первый взгляд он предстаёт перед публикой как легендарный мексиканский музыкант и звезда, но, как выясняется, его образ скрывает темные и амбициозные мотивы.\n' +
            '\n' +
            'Эрнесто де ла Круз является великолепным примером успешного артиста с аристократическим обликом и магнетизмом. Однако его настоящая сущность оказывается куда более сложной, чем кажется на первый взгляд. Безжалостный и амбициозный, он становится центральной фигурой загадки, связанной с семейной историей Мигеля.\n' +
            '\n' +
            'Эрнесто де ла Круз предоставляет зрителям не только визуально впечатляющий образ, но и символизирует важность раскрывания истин и оценки людей не по их внешнему облику. Его роль в сюжете подчёркивает тему предательства и жажды славы, а также важность честности и верности семейным ценностям.\n' +
            '\n' +
            'Таким образом, Эрнесто де ла Круз олицетворяет сложные аспекты человеческой природы и служит катализатором для развития сюжета в "Тайне Коко".',
        gallery: [
            "images/ernesto_de_la_cruz/ernesto_de_la_cruz1.jpg",
            "images/ernesto_de_la_cruz/ernesto_de_la_cruz2.jpg",
            "images/ernesto_de_la_cruz/ernesto_de_la_cruz3.jpg"
        ]
    },
    {
        name: 'Имельда', image: 'images/imelda.jpg', film: 5,
        description: 'Имельда — важный и влиятельный персонаж в анимационном фильме "Тайна Коко". Эта мудрая и сильная женщина играет ключевую роль в семейной драме Мигеля, а её влияние ощущается на протяжении всего фильма.\n' +
            '\n' +
            'Имельда предстаёт перед зрителями как глава семьи Ривера, занимающаяся созданием обуви. Её внешность и характер выражают традиции и семейные ценности. Имельда олицетворяет мексиканское культурное наследие и важность передачи традиций от поколения к поколению.\n' +
            '\n' +
            'Центральная тема связи Имельды с Мигелем касается семейных уз и любви к искусству. Её решимость и самопожертвование для блага своей семьи служат важным примером силы и преданности. В сюжете фильма также раскрывается история музыкальной драмы между Имельдой и её прежним мужем, что добавляет сложности и эмоциональной глубины персонажу.\n' +
            '\n' +
            'Имельда становится символом семейных связей, а её история подчёркивает важность помнить и чтить своих предков. Её решительность и любовь к семье сказываются на развитии сюжета и вносят в него глубокий и эмоциональный оттенок.',
        gallery: [
            "images/imelda/imelda1.jpg",
            "images/imelda/imelda2.jpg",
            "images/imelda/imelda3.jpg",
            "images/imelda/imelda4.jpg"
        ]
    }
];



document.addEventListener('DOMContentLoaded', function () {
    const urlParams = new URLSearchParams(window.location.search);
    const characterId = parseInt(urlParams.get('id'));
    const characterName = document.getElementById('character-name');
    const characterText = document.getElementById('character-text');
    const characterImage = document.getElementById('character-image');
    const toFilm = document.getElementById('to_film');
    characterName.innerText = Characters[characterId].name;
    characterText.innerText = Characters[characterId].description;
    characterImage.src = Characters[characterId].image;
    characterImage.alt = Characters[characterId].name;
    const imgElement = document.getElementById("gallery-img");
    imgElement.src = Characters[characterId].gallery[1];
    toFilm.addEventListener('click', function () {
        window.location.href = 'film.html?id=' + Characters[characterId].film;
    });
});

let currentImageIndex = 0;
function changeImage(step) {
    const urlParams = new URLSearchParams(window.location.search);
    const characterId = parseInt(urlParams.get('id'));
    const gallery = Characters[characterId].gallery;
    currentImageIndex += step;

    if (currentImageIndex < 0) {
        currentImageIndex = gallery.length - 1;
    } else if (currentImageIndex >= gallery.length) {
        currentImageIndex = 0;
    }

    const imgElement = document.getElementById("gallery-img");
    imgElement.src = gallery[currentImageIndex];
}
